{"pages":[{"title":"About","text":"Team from UIUC going to 2020 ICPC World Finals.","link":"/About/index.html"}],"posts":[{"title":"ICPC North America Qualifer 2020 遊記","text":"前言最近閒來無事，\b\b\b就決定寫些比賽和訓練的心得，好讓大家不缺東西下飯，讓有在參加比賽的人一起進步，也讓我老了的時候能夠回憶年輕時到底為什麼這麼菜…… 本校往年都是以兩場比賽作為校隊選拔的依據，其中第二場正是以全美共同參加的 ICPC North America Qualifer（簡稱NAQ）作為標準。然而今年似乎是因為疫情的關係，亦或者是因為教練偷懶，而取消了第一場校內比賽，僅以 NAQ 作為唯一的選拔依據。個人認為這或許也不是一件壞事，畢竟往年第一場比賽都只是抄抄近幾年美國各個區域賽的題目，了無新意，只是給選手們暖暖手罷了。 自從去年 NAC 失利，被我永遠的對手暴錘一頓之後，已經好久沒有認真準備比賽了。或許是因為 WF 的日期遲遲沒有定下來而沒有動力訓練，又或許是因為害怕了解到我永遠的對手其實根本沒有把我放在眼裡的這個事實，導致我常常找不到寫題的目的。渾渾噩噩了一年，自己的實力似乎也停滯不前了。然而幾天前，在頹廢的滑手機時，突然看到了去年比賽的影片。 影片中那個既熟悉卻又有點陌生的人似乎並沒有因為已經沒有奪冠的希望而放棄寫題，而是專心的處理手上會寫的最後一道題，直到比賽只剩最後十分鐘時確定 AC 後，才鬆了一口氣；他那專心致志的精神，著實讓我非常感動。因此，隨著新的賽季的到來，我打算擺脫這個頹廢的我，重新出發，再走一遍和去年同樣的路，追逐影片中那個人的腳步。希望藉由在整個賽季的起點，在校選虐虐菜，找回一些自信。 遙想在上次的 NAQ 中因為沒有解出最後一題而與冠軍失之交臂，只落得全美第十二名的成績。考量到自己的狀態並沒有很好，這次 NAQ 賽前我給自己的期許也僅止於 AK、全美前十名和暴捶前隊友罷了。 比賽經過插曲賽前突然被通知說八題中的四題會有 First Blood 獎金時，就有在猜測是不是會有四題原題了。不過畢竟是來復健的，也沒有太在意這件事情，還是打算照著自己的節奏從簡單題往難題開始做以免翻車。 策略聽說今年校內選拔因為疫情的關係，來的人很少而且都是些新手，估計會是歉收的一年，因此我的策略就是打算開場的時候先囤一些簡單和中等題，等到大部分的人都過題後再交，以免帶給其他人太多壓力和帶歪校內的榜。 前期比賽正式開始，首先先攻克四題原題。這四題分別是一題簡單的八皇后問題（賽後聽說有些坑點，但我沒遇到就是了）、一題簡單暴力題、一題簡單的字串處理題和一題簡單的 SCC。題目不難，就只有那題 SCC 的題敘有點繞，看了兩三遍才讀懂。一邊打著哈欠寫題，一邊想著難道今年的 NAQ 就這？去年的 NAQ 至少還有最短路和動態規劃，再上去還有線段樹和 AC 自動機，今年的出題人也太瞧不起選手了吧🤔。不過我也提醒著自己，或許這些原題只是給那些菜雞寫的，難題還在後面，不能掉以輕心。 原題過完之後決定先來做這題 H，因為這題一臉就看起來像演算法作業一樣，感覺隨便搞搞就能過了。果不其然，這題感覺只需要一個簡單的動態規劃。然而看看校內的榜，怎麼還沒有人做出來呢，究竟是我看錯題了還是其他人太菜呢🧐？ 再來打算來想想這個 E 題，畢竟這種樹上路徑問題通常用一些套路就可以解決了🌲。想了兩分鐘卻想不太出來，結果不小心睡著了💭。迷迷糊糊之中，似乎在夢裡想起了之前訓練時教練說過的話：「你們也太菜了吧，這題也不會做。這種樹上路徑計數問題只要把相鄰的邊隨便配對就行了。」仔細想想似乎很有道理，這種題我怎麼不會做呢？肯定是在做夢吧，然後我就從夢裡醒來了。醒來後把思路整一整，也快速的寫完了這道題。 比賽開始後只過了 45 分鐘，我就只剩 B 和 G 兩題了。看看校內的榜大部分的人都有過題了，因此打算先把手上囤的這六題交上去看看結果如何。 稍作休息在等待這六題的結果時，我也在躊躇該先做剩下兩題的哪一題。想了一會也沒有結果，打算去外榜研究研究到底哪題比較簡單。一打開外榜，我X，怎麼有人已經 AK 了。揉了揉自己的雙眼，確信自己沒有看錯，心裡只有一個疑問：你到底是誰！往左看過去，發現正是我心目中永遠的對手，心裡感到一陣惆悵，又輸了一次😩。研究了一下，發現他兩題之間只差了一分鐘提交，也不知道到底哪題簡單。一無所獲的我只好回到自己的比賽頁面，值得慶幸的是我六題都過了，重回了校榜榜首，並且甩開後面的人兩到三題，看來今年本校只有我握有挑戰 AK 的資格了。 中期又仔細看了看 B 和 G 兩題，打算先切這題 B ，因為我對 G 毫無想法。 B 題是題計算幾何，其實這題也不太難，看完題目就知道怎麼做了，只是需要寫圓交和掃描線，我平常在隊裡也不是負責這部份的，因此才把這題留到現在才寫。整了整思路，最後決定還是不要太在意面子了，拿出了我私藏的 1000 行幾何大板，把掃描線的部分寫一寫之後，這題也就輕鬆寫意的通過了。 後期終於只剩這題 G 了，比賽也還有 100 分鐘，感覺離 AK 不遠了。然而接下來的 60 分鐘，我一無所獲。時間在一點一滴的過去，我的心也在逐漸變涼。後面的人一個個追上，我也開始懷疑這題是不是我根本做不出來。無論從何種角度來看，我都必須 AK ，這是臉面，沒有 AK 雖然也可能校內第一，但在面子上已經輸了。儘管焦急萬分，交了發暴力也不行，此時仍然毫無辦法。 轉折發生在第 150 分鐘，去了趟洗手間冷靜了之後，我突然發現為什麼暴力不會過了：存在數據讓操作必須從左邊傳到右邊，這導致了一輪更新需要 $O(n^2)$ 的時間因而卡掉了暴力的做法。轉念一想，這不就是波嗎。把題目的數據做些差分之後，每次操作就像是波一樣把當前的值向左右傳播。考慮了一些自由端和固定端而引發的振幅比例問題之後，迅速寫了一發。現在樣例都過了，罰時因為先前的巨大優勢，所以就算現在暴捶也能領先校內其他人，是時候給他們致命一擊了。提交， Accepted ！！！成功擊倒了校內其他選手🏆。 感想回到了最初的起點，順利地 AK、拿到了全美第六名和暴捶了前隊友，似乎拾回了當初喜歡刷題的心情，又重新燃起了寫題的渴望。稽查了一下其他學校，發現在我前面的分別是一個 MIT ， 一個 Swarthmore 和三個 Waterloo。也不知道他們是三個人打還是一個人打，但也與我無關了，畢竟他們跟我們不同區，而區賽大概也是我這個賽季的終點了。儘管在這次的比賽中證明了自己的實力，得到了想要的東西，身為一個老人果然還是應該服老，把機會讓給年輕人了。\b感覺也沒什麼遺憾了，就好好把握這個賽季最後一次比賽的機會，在區賽做到最好吧。也開始期待今年的隊友到底會是誰了，希望不要覺得我太菜🥬。","link":"/2021/02/11/2020naq/"},{"title":"2021 NADC &amp; UTPC Spring Open Contest 總結","text":"NADC 心得NADC 結束了，我曾經以為那是我再次閃耀的舞台，實際上我卻只能向封面那隻魚一樣，孤獨地看著兩個前隊友表演。西區是涼風的一支獨秀，他帶領著 UCSD 輕鬆地拿到了西區冠軍。反觀 Jason 隊竟然只在中區拿了第三名，輸給 Wisconsin-Madison 的兩支隊伍，並且在總排名中也沒有排進前三十名。儘管 Jason 隊還是藉由區域保障名額晉級了 NAC ，但以現在的狀態來說，我覺得他們想要進入 WF 還是難如登天。然而更沒有想到的是，另一個前隊友盧卡斯竟然只在中區拿到了第四名，UIUC 的榮耀竟然就這樣失守了😡，看來只能等我明年來重鑄我校的榮光了。 UTPC 經過序距離上次更新訓練總結已經過了一個月了。明明是一週一練，卻只有我在寫訓練總結，不知道涼風和盧卡斯什麼時候能把欠著的東西交出來😪。 考量到盧卡斯和涼風剛比完 NADC ，而且盧卡斯似乎還沒從連續兩次輸給 Jason 隊的陰影中走出來，因此這週的訓練就打算找個不會太難的比賽輕鬆打一下而已。剛好這週六有德州大學奧斯汀分校的邀請賽，因此就決定把這個比賽當作這週的訓練了。 賽前觀察看了參加比賽的隊伍名單，我們認為這場比賽中最強勁的對手是一支名為 Cameron Reynoldson Fan Club 的隊伍，由兩個 CF 紅名組成，隊伍 rating 高達 2900+，是個值得一戰的對手。 前期這場比賽前期其實也沒什麼好說的，就是除了 DEF 三道題以外的十個題，值得一提的題可能是 I 和 K 吧。 I 題的話涼風一開始猜了個結論卻沒有過，於是找了盧卡斯來討論並且由盧卡斯重新寫了別的算法但也沒過。最後發現是盧卡斯沒有讀題而涼風也沒有把完整的條件跟盧卡斯說，導致盧卡斯寫出來的代碼有特例沒有判掉，以後可能要避免這種狀況發生。 K 題的話我寫了個後綴數組並且用前綴最大值優化 dp，感覺上並不是一道很簡單的題，但很多隊都做出來了，因此可能有不用後綴數組的方法吧。 做完十個題之後也差不多過了兩個小時，這時候大概位在二、三名左右，也沒有落後太多題，衝擊冠軍還是很有希望。 中期這場比賽可能沒有中期吧，寫完前十題之後就只剩三題沒什麼人做出來的題目。剩下的三題我都已經看過了，就把 D 給了涼風， E 給了盧卡斯，而我開始想 F 。 後期剩下三題中最先有想法的是 D 題，涼風說把二分圖匹配轉成最大流之後，在流上隨便搞搞就行。但是他提出的隨便搞搞的方法我都覺得不太行，我思考了一會，突然想到在剩餘網路中找 SCC 然後判一下好像就可以了，涼風也覺得好像沒問題，於是就由我開始寫 D 題而涼風去看 F 題了。 從大一開始參加比賽到現在也已經過了快三年了，感覺近來一年似乎在想題上沒有什麼進步，然而最近練習的時候常常會感覺這題好像在哪裡看過，有可能是以前寫過的題，又或者是學校上課有教類似的東西，可能是這幾年的努力終於開始有一點點可見的成果了吧，希望能在 WF 前有所突破，但別變成像盧卡斯一樣只會說這題我以前做過但是我忘記怎麼做了🙄。 在約莫兩個半小時左右，我提交了 D 題並且一發通過，成為了第一支通過 D 題的隊伍。於此同時，盧卡斯在想的 E 題越來越多隊伍通過了，盧卡斯感到非常緊張，深怕是哪道自己做過的題但忘記怎麼做了。好在盧卡斯東搞搞西弄弄之下，終於在三個小時後通過的這道 E 題，好像是一道哈希的題目。 最後只剩 F 題了，F 題的第二個部分已經會做了，只剩第一個部分的 SG 函數還不知道長怎麼樣，隨便猜了幾個之後發現交上去都不對，也自己找到了幾個反例，於是涼風決定開始打表。最後終於在三個半小時左右發現了規律並通過這題，成為了第一個 AK 的隊伍並確保了冠軍。 總結這場 UTPC Spring Open Contest 其實也沒什麼好總結的，就是一場滿簡單的比賽，可能就罰時方面要注意一下不要像今天一樣錯這麼多次就行。 很多人都說今年北美的總體實力比去年還要強一些，多了好幾位 IGM 以上的選手，但我卻認為跟去年並沒有什麼差別或許還更弱了一點，只是因為 CF rating 膨脹了而已。反倒是 NADC 這場比賽在三個人都可以寫題的情況下，我認為要能寫出十題才算是有實力的隊伍，然而卻只有 MIT 和 Waterloo 做到。如果我沒有誤判題目的難度，那這就代表今年北美只有 MIT 和 Waterloo 值得提防，其他隊伍完全沒有競爭力，大概就像我 NAQ 拿了第六名的時候預測的一樣吧。喔，可能還有 UCSD 吧，我還是十分看好涼風能在 NAC 上左打 MIT 右踹 Waterloo 奪得冠軍。我會覺得今年北美實力不比去年，可能是因為我只關注 UIUC 而 UIUC 變弱了，又或者是我永遠的對手今年也沒參加比賽的緣故吧。 明明在這種只需要提防 MIT 和 Waterloo 的情況下，晉級 WF 是件不怎麼困難的事，但我卻覺得 Jason 隊現在做不到😢。希望他們能在這個暑假提升自己的實力，不要斷了 UIUC 連續好幾年進 WF 的紀錄。","link":"/2021/04/29/2021utpc/"},{"title":"XXI Open Cup GP of Belarus 訓練總結","text":"起因時隔三個多月，我隊終於又恢復了一週一練，準備衝擊不知道延到什麼時候的世界賽。預計接下來的更新都會是我隊的訓練總結，相信我的隊友會被多次提及，因此先幫他們取個稱號，以便區分。還留在我校的博士生，亦即提出了普通黃名理論的隊友，就叫他盧卡斯；另一個去 UCSD 煉丹的隊友就照他的 CF Handle 叫他涼風，儘管我也不知道這個翻譯正不正確。 隨著新的賽季的到來，我校現在多了一支準備參加全美冠軍賽的隊伍，因此接下來的訓練恐怕都是要跟他們一起訓了。為了方便，以他們最年長的人命名，暫且稱呼他們為 Jason 隊好了。一想起兩週前的 MCPC 我和盧卡斯各自被 Jason 隊暴錘了一頓，心裡不禁傳來一股惡寒，想必接下來場場訓練不管在題數還是在罰時上，都要被 Jason 隊壓在地上摩擦了。 訓練經過策略我們這隊亙古不變的開場策略就是盧卡斯負責讀前面三分之一的題目、涼風讀中間三分之一的題目、而我負責後面三分之一的題目。不過常常發生的事情是盧卡斯覺得 A 是道可做題就陷進去了、而涼風只喜歡讀題目很短的題，因此到最後我也不是很確定到底哪些題被看過了，這可能是需要注意的地方。 前期先說我負責的部分吧，看完後面五道題之後發現了 J 是道簽到題就光速地過掉了，與此同時也大致上認定了 L 是一道不可做的毒瘤題。接下來就跟著榜把 M 和 N 兩道前中期題過掉，算是個非常平穩的開局，也大致上對 Jason 隊打出了對位優勢🛫。 再來說說兩個隊友吧，盧卡斯似乎沒有在前面找到簽到題，但還是說了每一題好像都可做，但我仔細想了想，他好像每次訓練都這樣說，因此也沒有太當真。涼風則是拿出了他常規的套路，表示 G 應該沒有很難但是他不會做🤤，然後就把這題扔給了盧卡斯。其實我也沒有看過這題，不過好像是要算有多少個樹有完美匹配，但盧卡斯說他也不會🤔。就在思考的同時，涼風說 I 他隨便猜個結論就過掉了，想必也沒有很難。隨著一波刷榜，發現 Jason 隊已經把 G 過掉了，而盧卡斯依然沒有任何建樹。盧卡斯似乎又想起了 MCPC 的失敗，走不出這道陰影。好在最後他說用 Prüfer code 搞搞好像就能過了。 G 過了之後，涼風也跟著榜把 D 和 C 過了。 隨著在 95 分鐘過了 C 之後，前期也大致結束了。儘管三個多月沒訓了，但感覺還是個滿日常的開局，隊友都用了他們最熟悉的套路搞了一波，但還是有驚無險地度過了前期。比較讓人在意的是 Jason 隊明明有三台電腦，卻沒有在前期領先我們，不禁讓人懷疑他們是不是在隱藏實力🤔。 中期這場訓練中期其實感覺算翻車了吧。首先涼風說了他要去吃飯順便划個水，所以我也不太清楚他在搞哪一題，不過感覺是 \bB 吧。我則跟著榜在弄 E ，儘管出了兩個假算法，但其實也沒有很久就知道了正確的算法，最讓人頭疼的是真算法交上去一直過不了但我又找不到 bug ，最後只好 assert 一些東西終於找到了 bug ，才在 216 分鐘過了這道題。而盧卡斯說 A 是道 Fast Walsh–Hadamard transform 所以就交給他了，但他搞了兩個小時說好像不太行，最後又花了一個小時搞了個分治終於在 243 分鐘過了這道題。中期也就過了這兩道題，感覺就整個崩盤了。 本來以為我們中期已經很慘了，但在 4 個小時過去之後 Jason 隊還是只過了 7 道前期題，比我們更慘。但轉念一想，該不會是在囤題要給我們一個驚喜吧🎉。 後期平常大部分的訓練都是由我來決定最後要做哪道題的，但這次訓練因為被 E 卡住而沒有時間仔細想其他題，因此就交給了中期看了最多題的涼風來決定了。而涼風說榜上比較多人過的 BFH 他覺得 B 比較可做，因此我們最後一個小時就在看 B 了。儘管最後也沒有做出來，但也不能說這是個錯誤的決定，畢竟涼風好像也想了很久的 B ，而且就算去做 F 或 H 也不能保證能做出來。最後我們隊就以 9 題作收。 比較讓人疑惑的是 Jason 隊最後也只過了 7 題，相當於是最後罰坐了三個小時💺，不知道是不是有人在搞還是單純不適應 GP 系列的比賽，希望他們可以加油一點就是了。 總結總結大概就是菜吧。賽後仔細想想 BFH 實際上還算是在我的守備範圍內的題目，但就是比賽中被 E 卡住了導致沒什麼時間去想這些題。感覺我出真算法但是找不到 bug 的時候，就應該要把這題給其他人看看代碼有沒有哪裡有問題，然後我去想其他題才對。又或是要考慮一下我是不是不要寫中期題🤔。另外在這次訓練中也發現了一個問題，就是盧卡斯在想不出題的時候就會說頭很暈，也不知道是怎麼回事，以前訓練也常常發生，希望能找到方法解決。 賽後 Jason 隊跑來說題目太難了下次能不能訓簡單一點的，也不知道是不是在假裝自己很菜。但我感覺這已經是 GP 系列中算簡單的一場比賽，果然給他們訓 GP 還是太早了一點嗎？","link":"/2021/03/24/XXI-GP-Belarus/"},{"title":"ICPC North America Division Championships 2021 游纪","text":"序章望过香槟四月的飞雪，终于等来了我队区域赛出线的奖品，也是我本赛季的终点：2021 ICPC North America Division Championships。已经过去了将近两个月，我却仍然无法从失败的阴霾中走出来。回想起三月初 MCPC 被 UIUC-B 封榜后反杀的耻辱，我只能在他人的欢笑庆祝声中走向无人问津的角落。那种未能卫冕的失落感时刻煎熬着我，让我迫切地想在 NADC 中证明自己。两个月以来，UIUC-B 一路进行着密集的训练。反观我，却只能当他们每周的陪练，做一些半吊子题。成者王败者寇，我也只能期许 NADC 能帮助只剩下最后一年算法竞赛生涯的我，找到继续比赛的理由。 尽管抱着求胜的信念，红⚪绿方的旗帜却让我清醒了过来。不行，我赛季初做出了绝不踏进 World finals 一步的承诺。希望这场比赛我能当好那条鲶鱼，让 UIUC-B 奋勇过题捧杯，卫冕去年敝队击败 Wisconsin 捧起的 Central Champion 🏆吧。赛前分析了一下 Central Division 的形势，作为最弱的 Division，唯一有希望与我们竞争的也只有两只 Wisconsin 的劲旅。其中一支和 UIUC-B 的配置类似，属于两个普通黄名带一个小弟；另一支则与本队类似，属于一个非普通黄名带两个小弟。然而稽查后却发现两支队均早已疏于训练，我实在是想不出 UIUC 不能卫冕的理由。 比赛经过前期按照 Regional 的老规矩，我还是从中间开题。F 和 G 过于长的题面让我很快将目光移向了 H。H 是一道十分经典的字符串传统题，而我至少已经见过它与它的变种不下五次。我知道该我来教训一下这群平时不刷题的人了！我熟练的找到了原题，然后去网上找到了通过此题的 code，提交！却返回了 Wrong Answer。我压力瞬间变大，现在放弃就意味着失去了颜面。我不慌不忙的找到另一份 code，继续提交！可是不管我找了谁的 code，提交的结果却一直是无法通过。灰心丧气的我打开了自己高中时候的博客，希望能读一些过去的文字来给现在的我一些安慰，却不料在后缀数组专题里看到了这道熟悉的题。我拾起这份六年以前的代码，上面似乎有着高中生的我稚嫩的气息。提交！Accepted！First Blood！那一刻，我仿佛回到了我高中的机房，面向梧桐树叶飘舞的窗。等我回过神来，我们队已经在这个弱区的中段徘徊了，而 UIUC-B 却还在倒数的位置😡。我有一丝不详的预感，但内心却只能相信 UIUC-B 的实力。 在这之后我又很快看完了 EFGHI。令人惊讶的是除了 E，其他的题的 First blood 居然都已经被抢了😡。而 E，确实一道我暂时不太会做的几何题。一位队友给了我 B，又是一道字符串的题目：给出一个文本串，每次询问某个给定的串在文本串中出线第 k 次的位置。我稍微思考了一下，就将问题转化成了 Fail 树上子树查询 k 大的问题。而子树 k 大又是一道经典的 dfs 序上维护可持久化线段树的题目：两部分都是非常经典却对没做过的人很难想到的转化。我知道我的 First Blood 的机会又来了，赶忙 copy+paste 两部分的 template 并在 57min 1Y FB 了此题。做完这题我感觉神清气爽，认为这题不会有很多队能做出来（事后被打脸了）。看了一下 UIUC-B，居然还在我们队的下面😡。 之后神勇的某位队友成功的通过了 F 和 I，发挥超常。而另一位队友不负众望，仍然在 M 题上挣扎，甚至提出了让我处理的请求。我看了一眼 M 是个签到题，并不是我心目中想证明自己的题目，拒绝了他的请求。截止到前期结束，UIUC-B 一直以一题之差，巨大的罚时劣势被我们踩在下面。我不清楚是否孟加拉国的旗帜同样在他们心中飘扬，但我知道从现在开始必须要慎重了。稍有一步闪失，大草原和🐯将向我招手。我急忙恳求队友们不要再写题了，并提出大家一起聊聊天喝喝水休息一下。可是两位队友并不领情，skype 中仍然传来噼啪的键盘声😡。 中期中期看了一下其他 division 的 scoreboard，暂时明确了接下来大概要做的几道题：ACDKL。前期的题目除了 M 都已经被磕磕绊绊过掉。我看了下 C，弄出连通块后很明显变成了一个二分图最小点覆盖的裸题，但我们区却没有人通过😡。我很快写了一下，修了几个 bug 后又拿到了一个 First Blood！三题三个 FB，我已经获得了排山倒海般的自信。刷一下榜，发现仅有一支 Wisconsin 的队伍以罚时优势在我们之前。而 UIUC-B 仍然严格被我们踩着一题。这种与训练赛截然不同的反差让我慌了神：我似乎比较确信他们中有人知道了今年 WF 的地点，展示着精湛的演技。114min 另一位给力的队友终于 6Y 了签到题 M，过了他全场第一道也是唯一一道通过的题，我们队也因此到了榜首。而先前神勇的队友很快的找到了 A 的做法，我也似乎有了 D 和 K 的思路。10 题的光明未来就在我们眼前。 然而，我突然发现 UIUC-B 已经落后我们两题了，并似乎还对 H 毫无头绪。H 这种程度的字符串题目都遇到困难的话，很难相信他们能做出 B 这种级别的题。随着 BH 的卡题，剩下的时间很难让他们再去思考都没人开的题目：一旦我们通过 A 到达 8 题，他们将几乎不可能超过我们，而我们也将踏上孟加拉国的旅程。经过深思熟虑，我打算让两位队友都停止交题，静观其变。 后期UIUC-B 的萎靡还在继续，他们终于在封榜后的 153min 提交了 H。经过计算，假设他们通过了 H 也就是 7 题，他们的罚时和我们只会相差 20 以内；而如果这发无法通过且无新题在封榜后通过，我们将以 7 题罚时优势出征 NAC，拿下孟加拉国的机票。不管怎么样，A 题是绝对不能提交了！更为不利的是，Wisconsin 两支队发挥出色，很明显比 UIUC-B 强上一等：如果就这样坐以待毙的话，我们很可能会失去 Central Division 的前两名，遭到 Wisconsin 来自去年 NAC 的复仇。 UIUC-B 的 H 题似乎再也没有提交过，但却也没法给保证他们不会再次提交。经过一番讨论，我们得出如下结论：如果最后 10min UIUC-B 再次提交了 H，我们便放出手中囤着的题（A + D/K）来夺冠捍卫 UIUC 的荣耀；相反我们则偃旗息鼓，沉沦在 UIUC 本赛季的黑暗之中。时间一分一秒的过去，我的心也在一点一点的变热：看上去 UIUC-B 确实通过了 H 并以罚时优势踩回了我们；同时却也在一点一点的变凉：我似乎已经能预见到今年的惨败，mattox 的失望以及圈内人的嘲笑。 比赛结束之后，意料之中的得知了 H 确实通过的消息。UIUC-D 的征程也就到此结束了。然而对于 UIUC-B 来说，他们所迎来的却不是一个甚至过得去的结果：如此对 Wisconsin 一边倒的惨败将会是他们人生难忘的一课。在 NA 的另一边，我的 WF 前队友带领着 UCSD 拿下了 West Division 的冠军。成者王败者寇，往日的冠军却落得截然不同的境地，令人唏嘘。赛后虽然收到了教练的祝贺邮件，却也食之无味。 总结现在也无法确定，现在的凄惨境地是否是当初赛前的一顿操作导致的。但非常确信的是，UIUC-B 在这一场中展露了他们最大的短板：训练量不够导致经典传统题目无法快速解决。NADC 结束后，下一年的 Regional 很快也会到来。今年的 NADC 给了我不多不少的勇气来挣脱整个赛季的阴霾。考虑到目前的形势（以及我的 WF 前队友仍然在战术隐忍），我明年估计要复兴 UIUC 的 ICPC，将我的最后一年献给值得信赖的队友吧。","link":"/2021/04/26/nadc21/"},{"title":"2020 MCPC 校隊分析","text":"我中了！窗外靄靄白雪，校隊名單彷彿被隔在雪的另一端似的， NAQ 都結束好幾天了，依然杳無音訊。看著窗外漫天雪花飛落，我尋思著為何校隊名單遲遲不公佈，難道是前幾名的組隊意願兜不攏？還是說教練還在考慮是不是不應該讓菜雞如我去參加區賽，丟我校的面子？正當我以為今天也不會出來之時，一封郵件突然跳出來，殺得我措手不及。懷著忐忑的心打開郵件一看，果然是校隊名單！滾到名單最下面找到我的名字時，心中的大石頭終於放了下來，萬分感激教練願意給我這個菜雞一個校隊的位置，剩下只求隊友不要覺得我太菜了🥬。 校隊分析好像是從 2019 年開始吧，本校校隊都是根據校內選拔的綜合排名，以 A~E 命名的。然而最後區賽的排名也沒有完全依照此順序，因此大家今年也就只把這個當作參考而已。以下為本校校隊組成不負責任之分析： A隊CF Team Rating: 2269\b / 奪冠指數: ⭐⭐⭐ 我認為這隊的看點是那位 USACO Finalist，儘管上次區賽似乎發揮得不如意，但我相信長年累積下來的寫題經驗是不會背叛他的。其他的兩位隊員聽說也上過一些算法課，但感覺在比賽中也只能幫忙解決一些前中期題，到了後期還是得讓 USACO Finalist 接管。這在今年的賽制下是一大隱患，畢竟如何高效地利用三台電腦才是奪冠的關鍵。這隊的奪冠條件我覺得是要出兩題後期題吧。 B隊CF Team Rating: 2301\b / 奪冠指數: ⭐⭐⭐⭐⭐ 我認為這隊是在今年的賽制下最有優勢的一支隊伍。三個人實力平均，都有寫題的能力，因此在前中期肯定能取得罰時優勢。儘管從 CF 上看來兩名黃名隊員似乎只是普通黃名（我 WF 前隊友提出的分類，代表上黃名之後就不再參加比賽的人，主要是用來區分他自己這個非普通黃名和其他普通黃名的不同），會讓人懷疑是否能在區賽中做出後期題，但我認為其實不用太擔心，其中的一位黃名是 APIO 2018 新加坡代表隊隊員，相信以往刷過的題肯定能在賽場上為她帶來一些靈感。利用前期的罰時優勢，這隊的奪冠條件我覺得是只要出一道後期題就行。 C隊CF Team Rating: 1470 / 奪冠指數: ⭐ 歷年來我們學校總是組不出五隊強隊，今年也不例外。這隊的唯一看點就是那位 USACO Plat，在區賽強敵環伺的狀況下，究竟能不能發揮出他應有的實力。我完全想不到這隊奪冠的可能性，還是明年再來吧。 D隊CF Team Rating: 2351 / 奪冠指數: ⭐⭐⭐⭐ 這隊的實力分佈和 A 隊類似，以我的 WF 前隊友作為單箭頭，因此缺點也就跟 A 隊一樣，是無法完全地利用三台電腦創造出優勢。但是感覺我的 WF 前隊友刷刷前中期題還是滿快的，因此在罰時上不一定會處於劣勢。唯一的隱憂就是這個單箭頭可能會自己把前中期題做完，導致另外兩位隊員只能罰坐五個小時。如果其中一位隊友可以站出來，過掉一題關鍵題的話，想要奪冠還是大有可為。憑藉著單箭頭快速過題帶來的優勢，我認為這隊的奪冠條件和 B 隊一樣，只要出一題後期題就行。 E隊CF Team Rating: 2502 / 奪冠指數: ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐ 這恐怕是在我的記憶當中，我校第一次在區賽時就組出 CF Rating 2500+ 的隊伍吧。之所以如此強調 Rating ，是因為當 Rating 差超過 200 分時，就會有顯著的差異。這隊的核心就在於那位紅名，儘管看起來像個普通紅名（定義同普通黃名），但我並不認為紅名會在任一個算法主題暴露出極大的缺陷，因此在需要以後期題分勝負的區賽當中，這隊是唯一不需要祈禱後期題剛好是擅長的主題的一支隊伍，所以也應該不會發生一題後期題 E 隊沒做出來而其他隊做出來的狀況。我覺得這隊是區賽中最具有冠軍相的隊伍，想不太到輸的可能性，唯一的可能恐怕就是紅名在比賽中開始罰坐睡覺吧。 總結感覺今年我校要在區賽奪冠還是沒什麼大問題，想必最後還是校隊的內鬥吧。我也該趕緊聯絡隊友問問什麼時候開始訓練了，希望他們可以帶我飛🛫。","link":"/2021/02/16/uiuc-team/"},{"title":"ICPC World Final Moscow 2021 之旅","text":"前言现在时间是二零二二年三月十六日美西中午十二点四十五分，我在San Francisco附近Stockton的上空，乘坐着从San Diego到Seattle的飞机，开始写这个五个多月前发生的事情。 时光飞逝，本来怀着夺牌和去Cancun + Punta Cana 双重度假的喜悦离开了莫斯科，可似乎是我的好运在红场用光了，等待着我的是长达一个半月的流落他乡和研究不顺利的苦恼。但如果我暂且把这些放在一边，那被墨西哥遣返前的两个星期，可能会是我非常难忘的回忆。 抵达了，俄罗斯！在前去俄罗斯之前就预料到签证不顺，但我还是义无反顾的踏上了一条Irvine -&gt; Houston -&gt; Monterrey -&gt; Cancun -&gt; Moscow的行程，路途中种种历历在目。但总之，乘坐着一趟奇奇怪怪的航班，我是我们队伍中第一个到达莫斯科的。入住了说是五星级的酒店（但似乎除了餐厅外并没有高级到哪去），花了十刀左右的卢布吃了可能一个早餐饼裹酱😡。 Huawei Challenge上一届比赛中，UIUC在Huawei Challenge 中夺得了第二名。听说是手写一个boolean neural network做mnist还是啥的之后，我已经做了numpy for backpropgation的各种准备。 可这次华为似乎没有再对机器学习有所偏爱，出了一道明显是搜索+优化的题目。看到题目的那一刻我就傻眼了，我背下adam有什么用，难道要等明天world final比赛再用吗，但想必队友也不会给我这个尝试的机会。不过我迅速调整了心态—当时还有人题目都打不开，我得利用好这个先发优势。 题目是个奇奇怪怪的真·网络流，不是用正常的Dinic啥的。我胡乱写了个搜索，加了点条件，提交！在榜单上前十一下就出现了我的名字 — 坚持下去，就有电脑可以拿了，我这么想着。然而事情比我想象的复杂，在连续做了三个负优化后，我的工作台死机了！过了大概三十秒终于有反应后，我想着是因为jetbrain占内存太恐怖了吗？于是马上关掉了CLion， 打开了vscode。但不到三十秒后，又死机了，这个时候我的心态已经产生了一点波动，因为肉眼可见的我附近的队友和其他学校的学生都没有遇到我这个问题。尝试向裁判询问，也一点结果都没有，把vscode换成了vim， 仍然还是卡死。最后好歹试了下万能解法，重启！竟然就没有再死机了，但这个时候也只剩下了不到一小时，而我已经掉到了十名开外。 但在这最后一点时间里，我完全没有软手，把之前想好的一个大优化哗哗哗的写了出来，速度之快我自己都不敢相信。而且运行一次过，连segfault都没有，这是我写c++以来极少遇到的事情。怀着激动的心情，提交！ 又是一个负优化。。。我陷入了自闭。比赛结束后屈居第15名，给uiuc丢了脸。但似乎我的队友们比我还拉垮🤔，不知道他们遇到了什么情况。值得一提的是，我队友永远的对手， 虽然名次稍高一些，似乎和我是同一档的奖励—也许他们正赛的手软，在这里就埋下了伏笔吧。 World Finals正式比赛前的十分钟，我开始紧张了。想到我Huawei Challenge中开局的大优势但结果却送掉之后，我很怀疑这次uiuc能不能摆脱年年Honorable Mention的命运。 开局，直接自闭比赛开始了，按照惯例，Lucas负责看前面的题目，我看中间的，Alex从后往前看。但这次题目竟然有15题，我习惯了12题情形下的每人4题，于是从E开始看起。 E – 题目好长，跳掉吧。F – 好像有点印象见过类似的，但是个几何题，跳掉吧。 这时候Alex说他准备写O， 要二十分钟，我们也没有其他可做的，就先让他上了。 G – 看起来很简单，但没有什么想法，到时候再说吧。H – 好复杂，还是交互，算了吧。 怎么一道都不会，我这样想着，然后就看到UBC拿了全场的一血。快去看C题！我和Lucas说。 然后，几分钟之内，D题，E题也相继被过掉。我读完D，似乎没有什么想法，准备看E。 这个时候，Alex也交了O，然后迅速吃了一个WA，“怎么可能？”他这样说着。我看看我们一题都还没过的样子，和场上已经升起的多个气球，似乎感觉Honorable Mention在向我招手。 不过事情也渐渐有了转机，Lucas过了C，我过了E，给了D的算法，而Alex也放弃了他的最小表示法，用字符串匹配过了O。但我们已经落后榜首数题，罚时也很爆炸。 中期，奋起直追发扬着我口胡算法的本事，我给Alex提出了J的错误算法。我们似乎回到了平时训练的时候的感觉，在他听完我的错误算法和经典的到时候再说之后，马上就想出了正确的算法，然后实现成功。接下来我们讨论了M，似乎用一种很简单的方法就过了。Lucas说着G用三维偏序随便做吧，开始写不知道多长的代码。三个小时的时候过了之后就开始写F。我们回忆下，总算想起F是曾经见过的数三角形题目。而我在还在A上纠结，明明似乎有了一个算法，但似乎怎么都实现不出来。 封榜，侥幸过题这时已经封榜。场上已经有11题的队伍，而我们七题似乎排在二十名左右，总之是不会吃Honorable Mention了。Alex帮忙看了一眼A，马上就给了一个很好写的算法，看来他在开始的O题之后，发挥出了远超普通红名的实力。我花了点时间把A过掉，得知Lucas说F必过之后，开始帮Alex生成B的test case。Lucas马上也过了F，也一起帮忙写B的test case。而Alex自信满满，在B题上开了N^2的memory，说绝对没问题，然后写了一个明显是过于简单的算法。我虽然怀疑这道题按理说是要卡掉这种做法，但看Alex自信满满的样子，也不好说什么。Alex随便测了两组数据，然后提交。。。 AC!出乎我们的意料。Lucas甚至激动地跳了起来。我们已经过了10题，如果不出什么意外的话，甚至有可能拿牌，而这时候时间还剩下半小时不到。 我们开始看I。其实心中都觉得肯定来不及做的了。而事实上我们讨论了一下，没有结果后也就放起来。后来才得知I其实真的不难，半小时完全有机会，但我们当时应该是过于激动了，完全没有仔细想这道题。 比赛结束比赛结束后，我们根据榜上的排名和封榜后其他队伍的提交记录，大致确定我们会在10-13名之间。铜牌线在12名，所以很有机会能够拿牌。颁奖典礼滚榜的时候看到我们最终拿了第十一名，心中还是感慨万千。尤其是得知Alex永远的对手似乎发挥失常，和我们一样拿了铜牌之后—很可惜，要是做出了I就击败了他们吧。","link":"/2022/03/16/2021wf_zw/"}],"tags":[{"name":"NAQ","slug":"NAQ","link":"/tags/NAQ/"},{"name":"2020","slug":"2020","link":"/tags/2020/"},{"name":"2021","slug":"2021","link":"/tags/2021/"},{"name":"training","slug":"training","link":"/tags/training/"},{"name":"NADC","slug":"NADC","link":"/tags/NADC/"},{"name":"UTPC","slug":"UTPC","link":"/tags/UTPC/"},{"name":"GP Series","slug":"GP-Series","link":"/tags/GP-Series/"},{"name":"XXI Open Cup","slug":"XXI-Open-Cup","link":"/tags/XXI-Open-Cup/"},{"name":"MCPC","slug":"MCPC","link":"/tags/MCPC/"},{"name":"misc","slug":"misc","link":"/tags/misc/"},{"name":"world finals","slug":"world-finals","link":"/tags/world-finals/"},{"name":"2022","slug":"2022","link":"/tags/2022/"}],"categories":[{"name":"icpc","slug":"icpc","link":"/categories/icpc/"}]}